In [18]:
#importing libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb
import re
%matplotlib inline

## Question 1.

In [253]:
titanic=pd.read_csv('https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/train.csv')

In [254]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Question 2.

In [255]:
titanic['Survived'].isnull().sum()

0

In [256]:
titanic['Survived']=titanic['Survived'].dropna()
titanic['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

## Question 3.

In [257]:
titanic['has_cabin']=~titanic.Cabin.isnull()

In [258]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,has_cabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,False
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,True
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,True
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,False

## Question 4.

In [259]:

titanic['Title'] = titanic['Name'].apply(lambda x: re.findall(r'(Mr|Mrs|Miss|Master|Special).?',x))

In [260]:
titanic['Title']= titanic['Title'].apply(lambda x:''.join(map(str,x)))

In [261]:
titanic['Title']

0          Mr
1          Mr
2        Miss
3          Mr
4          Mr
5          Mr
6          Mr
7      Master
8          Mr
9          Mr
10       Miss
11       Miss
12         Mr
13         Mr
14       Miss
15         Mr
16     Master
17         Mr
18         Mr
19         Mr
20         Mr
21         Mr
22       Miss
23         Mr
24       Miss
25         Mr
26         Mr
27         Mr
28       Miss
29         Mr
        ...
861        Mr
862        Mr
863      Miss
864        Mr
865        Mr
866      Miss
867        Mr
868        Mr
869    Master
870        Mr
871        Mr
872        Mr
873        Mr
874        Mr
875      Miss
876        Mr
877        Mr
878        Mr
879        Mr
880        Mr
881        Mr
882      Miss
883        Mr
884        Mr
885        Mr
886
887      Miss
888      Miss
889        Mr
890        Mr
Name: Title, Length: 891, dtype: object

## Question 5

In [262]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
has_cabin        0
Title            0
dtype: int64

In [263]:
titanic['Age']=titanic.Age.fillna(titanic['Age'].median())

In [264]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
has_cabin        0
Title            0
dtype: int64

In [265]:
titanic['Cabin']=titanic.Cabin.fillna(0)

In [266]:
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       2
has_cabin      0
Title          0
dtype: int64

In [267]:
titanic['Embarked']=titanic.Age.fillna(0)

In [268]:
titanic.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
has_cabin      0
Title          0
dtype: int64

## Question 6

In [269]:
titanic['Categorical_age'] = pd.qcut(titanic.Age, q=3,labels=False)
titanic['Categorical_fare']= pd.qcut(titanic.Fare, q=10,labels=False)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,has_cabin,Title,Categorical_age,Categorical_fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,22.0,False,Mr,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,38.0,True,Mr,2,8
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,26.0,False,Miss,1,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,35.0,True,Mr,2,8
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,0,35.0,False,Mr,2,2

## Question 7

In [270]:
titanic=titanic.drop(['Cabin', 'Name', 'PassengerId', 'Ticket', 'Age', 'Fare', 'SibSp', 'Parch'], axis=1)

In [271]:
titanic.head()

,Survived,Pclass,Sex,Embarked,has_cabin,Title,Categorical_age,Categorical_fare
0,0,3,male,22.0,False,Mr,0,0
1,1,1,female,38.0,True,Mr,2,8
2,1,3,female,26.0,False,Miss,1,2
3,1,1,female,35.0,True,Mr,2,8
4,0,3,male,35.0,False,Mr,2,2

## Question 8

In [276]:
titanic.Sex=pd.get_dummies(titanic.Sex)
titanic.Title=pd.get_dummies(titanic.Title)
titanic.has_cabin=pd.get_dummies(titanic.has_cabin)

In [277]:
titanic.head()

,Survived,Pclass,Sex,Embarked,has_cabin,Title,Categorical_age,Categorical_fare
0,0,3,0,22.0,0,0,0,0
1,1,1,1,38.0,1,0,2,8
2,1,3,1,26.0,0,0,1,2
3,1,1,1,35.0,1,0,2,8
4,0,3,0,35.0,0,0,2,2

## Question 9

In [278]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split as tts

In [279]:
data=titanic.loc[:,titanic.columns!='Survived']
output=titanic.Survived

In [280]:
data.head()

   Pclass  Sex  Embarked  has_cabin  Title  Categorical_age  Categorical_fare
0       3    0      22.0          0      0                0                 0
1       1    1      38.0          1      0                2                 8
2       3    1      26.0          0      0                1                 2
3       1    1      35.0          1      0                2                 8
4       3    0      35.0          0      0                2                 2

In [281]:
output.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

## Question 10

In [282]:
input_train,input_test,output_train,output_test=tts(data,output,test_size=0.2)

In [283]:
input_train.head()

,Pclass,Sex,Embarked,has_cabin,Title,Categorical_age,Categorical_fare
37,3,0,21.0,0,0,0,2
385,2,0,18.0,0,0,0,8
322,2,1,30.0,0,0,1,4
562,2,0,28.0,0,0,1,4
403,3,0,28.0,0,0,1,5

In [284]:
input_test.head()

,Pclass,Sex,Embarked,has_cabin,Title,Categorical_age,Categorical_fare
571,1,1,53.0,1,0,2,8
425,3,0,28.0,0,0,1,0
887,1,1,19.0,1,0,0,7
131,3,0,20.0,0,0,0,0
656,3,0,28.0,0,0,1,2

In [285]:
output_train.head()

37     0
385    0
322    1
562    0
403    0
Name: Survived, dtype: int64

In [286]:
output_test.head()

571    1
425    0
887    1
131    0
656    0
Name: Survived, dtype: int64

In [287]:
model=LogisticRegression()
model.fit(input_train,output_train)
pred=model.predict(input_test)
results=pd.DataFrame({'Actual':output_test,'Predicted':pred})
results

     Actual  Predicted
571       1          1
425       0          0
887       1          1
131       0          0
656       0          0
797       1          1
26        0          0
39        1          1
358       1          1
681       1          1
848       0          0
524       0          0
152       0          0
64        0          0
85        1          1
418       0          0
171       0          0
365       0          0
620       0          0
113       0          1
12        0          0
211       1          1
81        1          0
633       0          0
91        0          0
890       0          0
184       1          1
718       0          0
90        0          0
132       0          0
..      ...        ...
254       0          1
255       1          1
566       0          0
528       0          0
847       0          0
99        0          0
504       1          1
295       0          0
529       0          0
62        0          0
559       1          1
781       1          1
362       0          1
380       1          1
320       0          0
35        0          0
258       1          1
359       1          1
482       0          0
124       0          0
3         1          1
856       1          1
169       0          0
264       0          1
381       1          1
783       0          0
376       1          1
883       0          0
700       1          1
495       0          0

[179 rows x 2 columns]

## Question 11

In [288]:
from sklearn.metrics import accuracy_score
accuracy_score(output_test,pred)

0.776536312849162